In [13]:
import pandas as pd

In [24]:
df = pd.read_csv("csv_data.csv")

In [27]:
## if there is no name of columns present in the data then apply (header = none)

df.head()

       name                  email       contact
0  Abhishek       abhi15@gmail.com  9.457893e+09
1    Manish  manishmoni3@gmail.com  9.473958e+09
2     Sunny      sunny46@gmail.com  9.469457e+09
3       NaN                    NaN           NaN
4       NaN                    NaN           NaN

In [28]:
type(df)

pandas.core.frame.DataFrame

In [33]:
list(df.columns) ## columns property return the name of columns

['name', 'email', 'contact']

In [34]:
df["name"]

0    Abhishek
1      Manish
2       Sunny
3         NaN
4         NaN
5         NaN
Name: name, dtype: object

In [35]:
df[["name"]]

       name
0  Abhishek
1    Manish
2     Sunny
3       NaN
4       NaN
5       NaN

In [38]:
type(df[["name"]]) 
## this will return dataframe bcz we write the name of columns through list without list thet return series

pandas.core.frame.DataFrame

In [40]:
## selecting multiple columns
df[["name", "contact"]]

       name       contact
0  Abhishek  9.457893e+09
1    Manish  9.473958e+09
2     Sunny  9.469457e+09
3       NaN           NaN
4       NaN           NaN
5       NaN           NaN

In [42]:
## returns the data type of each columns
df.dtypes

name        object
email       object
contact    float64
dtype: object

In [43]:
df2 = pd.read_csv("https://raw.githubusercontent.com/codeforamerica/ohana-api/master/data/sample-csv/addresses.csv")

In [44]:
df2

,id,location_id,address_1,address_2,city,state_province,postal_code,country
0,1,1,2600 Middlefield Road,NaN,Redwood City,CA,94063,US
1,2,2,24 Second Avenue,NaN,San Mateo,CA,94401,US
2,3,3,24 Second Avenue,NaN,San Mateo,CA,94403,US
3,4,4,24 Second Avenue,NaN,San Mateo,CA,94401,US
4,5,5,24 Second Avenue,NaN,San Mateo,CA,94401,US
5,6,6,800 Middle Avenue,NaN,Menlo Park,CA,94025-9881,US
6,7,7,500 Arbor Road,NaN,Menlo Park,CA,94025,US
7,8,8,800 Middle Avenue,NaN,Menlo Park,CA,94025-9881,US
8,9,9,2510 Middlefield Road,NaN,Redwood City,CA,94063,US
9,10,10,1044 Middlefield Road,NaN,Redwood City,CA,94063,US
10,11,11,2140 Euclid Avenue.,NaN,Redwood City,CA,94061,US
11,12,12,1044 Middlefield Road,2nd Floor,Redwood City,CA,94063,US
12,13,13,399 Marine Parkway.,NaN,Redwood City,CA,94065,US
13,14,14,660 Veterans Blvd.,NaN,Redwood City,CA,94063,US
14,15,15,1500 Valencia Street,NaN,San Francisco,CA,94110,US
15,16,16,1161 South Bernardo,NaN,Sunnyvale,CA,94087,US
16,17,17,409 South Spruce Avenue,NaN,South San Francisco,CA,94080,US
17,18,18,114 Fifth Avenue,NaN,Redwood City,CA,94063,US
18,19,19,19 West 39th Avenue,NaN,San Mateo,CA,94403,US
19,20,21,123 El Camino Real,NaN,Belmont,CA,94002,US
20,21,22,2013 Avenue of the fellows,Suite 100,San Francisco,CA,94103,US

In [45]:
df2.columns

Index(['id', 'location_id', 'address_1', 'address_2', 'city', 'state_province',
       'postal_code', 'country'],
      dtype='object')

In [46]:
df2.dtypes

id                 int64
location_id        int64
address_1         object
address_2         object
city              object
state_province    object
postal_code       object
country           object
dtype: object

In [47]:
df2.to_csv("user_address.csv")